---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.RetryTimes
source: html/201e6234-65a8-6dec-e350-688fed9d6eab.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.RetryTimes Property

The number of times Revit has tried to Save to Central." Its value is '0' at the first time.

## Syntax (C#)
```csharp
public int RetryTimes { get; }
```